// TypeScript file
namespace app {
    export var t = {
        FLIP_CARD : "Press Next and give it to the next player",
        FLIP_CARD_END:"Press Next and give it to the judge",
        WERE_DESC:"狼人杀 \n游戏的核心是，狼人要杀掉好人，好人要找出狼人并把狼人全部投票出去 在游戏内，存在着两个阵营（有的时候会形成三个阵营，但为了方便理解，我只会提到两个阵营）好人和狼人阵营 好人的阵营往往由平民（又称村民等等）和神组成 （神包含着很多身份，每个神都有各自的技能） 狼人的阵营由狼人组成（有的时候也会有有技能的狼） 狼人的游戏必须得有一名法官（也称上帝）法官可以被视为裁判，管理游戏秩序，走游戏流程 下面是一个很详细的游戏规则，如果想要充分理解游戏可以仔细阅读，如果只想大概了解，可以翻到最后直接去看最简单最直接的一个解释  此处以12人局举例 12人局标准由4个狼人，4个村民和预言家，女巫，白痴，猎人组成 游戏开始所有人会被发到一个身份，玩家将根据自己的身份游戏 游戏的开始是黑夜，黑夜的时候所有人都得闭眼，法官将宣布，狼人请睁眼，此时所有拿到狼人身份的玩家会睁眼，随后狼人需要统一意见，杀死一名玩家，并以手势告诉法官。法官在收到手势后会确认一遍并让所有狼人闭眼。  随后法官会让女巫睁眼，并告诉女巫昨夜哪名玩家死亡，女巫每局游戏有一瓶解药和一瓶毒药，女巫每天晚上只能使用一瓶药水。随后女巫可以选择解救那名被杀的玩家，或者使用毒药杀死任意一名玩家或是不动。  随后法官会让预言家睁眼，预言家每天晚上可以查验一名玩家的身份，法官会通过手势告诉预言家他所查验的人是好人身份还是坏人身份  随后天亮，所有玩家睁眼，法官不会立即宣布谁死了，而是先有竞选警长环节 任何玩家都可以举手来参选，参选的玩家将由法官随机指定一名玩家开始，依次进行一次发言。所有竞选的人发言结束后，所有未参选的人将会投票选出警长。如果出现平票，将额外进行一轮发言。警长在每天的放逐投票环节拥有1.5票。",
        KING_DESC:"国王游戏规则",
    }
}
